Revit 2027 API
RevolvedSurface.IsValidProfileCurve Method
Overload List
Name | Description
IsValidProfileCurve(Frame, Curve) |  Checks if the input profile curve is valid to create a surface of revolution in the given frame of reference.
IsValidProfileCurve(XYZ, XYZ, Curve) |  Checks if the input profile curve is valid to create a surface of revolution around the given axis.
Top
See Also
Reference
RevolvedSurface Class
Autodesk.Revit.DB Namespace